/*****************************************************************************/
/*!
@file   Camera.cpp
@author Yuki Kogawara
@copy   Copyright(C) 2016 Yuki Kogawara

******************************************************************************/

/*  インクルード
******************************************************************************/


#include "Camera.h"
#include "../Game/GameScene.h"
#include "Manager.h"
#include "Math\Math.h"
#include <math.h>


using namespace Game;
using namespace Framework;
using namespace Framework::Math;


/*  実装
******************************************************************************/

/******************************************************************************
@brief  コンストラクタ
******************************************************************************/

Camera::Camera()
    : Eye(Vector3(0.0f, 0.0f, 0.0f)),
    At(Vector3(0.0f, 0.0f, 0.0f)),
    Up(Vector3(0.0f, 1.0f, 0.0f))
{
    Viewport::Set(&vp, 0, 0, Manager::GetWindow()->GetWidth(), Manager::GetWindow()->GetHeight());
}

/******************************************************************************
@brief  デストラクタ
******************************************************************************/

Camera::~Camera()
{

}

/******************************** 実装ここまで *******************************/
