/*****************************************************************************/
/*!
@file   Error.cpp
@author Yuki Kogawara
@copy   Copyright(C) 2016 Yuki Kogawara

******************************************************************************/

/*  インクルード
******************************************************************************/


#include "Error.h"
#include <Windows.h>
#include <stdio.h>


using Framework::Error;


/*  静的変数宣言
******************************************************************************/


HWND Error::hWnd;


/*  実装
******************************************************************************/

/******************************************************************************
@brief  エラーメッセージ
@param  ErrorMessage    エラーメッセージ
******************************************************************************/

void Error::Message(const char *ErrorMessage, ...)
{
    char tmp[256];
    va_list args;
    va_start(args, ErrorMessage);
    vsprintf_s(tmp, 256, ErrorMessage, args);
    va_end(args);
    MessageBox(hWnd, tmp, "エラー", MB_OK | MB_ICONERROR);
}

/******************************** 実装ここまで *******************************/
