#pragma once
/******************************************************************************
/*!
@file   Scene.h
@author Yuki Kogawara
@copy   Copyright(C) 2016 Yuki Kogawara

******************************************************************************/

/*  インクルード
******************************************************************************/


#include "State.h"


/*  クラス定義
******************************************************************************/


namespace Framework
{
    class Scene : public State
    {
    public:
        Scene(){}
        virtual ~Scene(){}

        virtual void Init() = 0;
        virtual void Uninit() = 0;
        virtual void Update() = 0;
    };
}


/******************************* ヘッダここまで ******************************/
