/*****************************************************************************/
/*!
@file   Stage.cpp
@author Yuki Kogawara
@copy   Copyright(C) 2016 Yuki Kogawara

******************************************************************************/

/*  インクルード
******************************************************************************/


#include "Stage.h"
#include "Collision\OBB.h"
#include "Mesh/Model.h"
#include "../Framework/Manager.h"
#include "../Game/GameScene.h"
#include "../Game/MeshField.h"
#include "../Game/Plant.h"


using namespace Framework;
using namespace Game;


/*  実装
******************************************************************************/

/******************************************************************************
@brief  コンストラクタ
******************************************************************************/

Stage::Stage()
{
}

/******************************************************************************
@brief  デストラクタ
******************************************************************************/

Stage::~Stage()
{
    SAFE_DELETE(pMeshField);

    for (int i = 0; i < modelNum; i++)
        SAFE_DELETE(pModelList[i]);
    delete[] pModelList;

    for (int i = 0; i < plantNum; i++)
        SAFE_DELETE(pPlantList[i]);
    delete[] pPlantList;
}

/******************************************************************************
@brief  更新処理
******************************************************************************/

void Stage::Update(void)
{
}

/******************************** 実装ここまで *******************************/
