/*****************************************************************************/
/*!
@file   Viewport.cpp
@author Yuki Kogawara
@copy   Copyright(C) 2016 Yuki Kogawara

******************************************************************************/

/*  インクルード
******************************************************************************/


#include "Viewport.h"
#include <Windows.h>


using Framework::Viewport;


/*  実装
******************************************************************************/

/******************************************************************************
@brief  ビューポート設定
@param  X           始点X座標
@param  Y           始点Y座標
@param  Width       切り取る横幅
@param  Height      切り取る縦幅
******************************************************************************/

Viewport *Viewport::Set(Viewport *pOut, int X, int Y, int Width, int Height)
{
    pOut->X         = X;
    pOut->Y         = Y;
    pOut->width     = Width;
    pOut->height    = Height;

    return pOut;
}

/******************************** 実装ここまで *******************************/
