#pragma once
/******************************************************************************
/*!
@file   Computer.h
@author Yuki Kogawara
@copy   Copyright(C) 2016 Yuki Kogawara

******************************************************************************/


/*  インクルード
******************************************************************************/


#include "Character.h"


/*  クラス定義
******************************************************************************/


namespace Game
{
    class Computer : public Character
    {
    public:
        Computer();
        ~Computer();

        void Init(){}
        void Uninit(){}
        void Update();

    };
}


/******************************* ヘッダここまで ******************************/
