/******************************************************************************

@file   Keyboard.cpp
@author Yuki Kogawara
@copy   Copyright(C) 2016 Yuki Kogawara

******************************************************************************/


/*  インクルード
******************************************************************************/


#include "Keyboard.h"

using namespace Framework::Input;


/*  実装
******************************************************************************/

/******************************************************************************
@brief  コンストラクタ
******************************************************************************/

Keyboard::Keyboard() :
repeatTerm(10)
{
    GetKeyboardState(press);
}

/******************************************************************************
@brief  デストラクタ
******************************************************************************/

Keyboard::~Keyboard()
{
}

/******************************************************************************
@brief  更新処理
******************************************************************************/

void Keyboard::Update()
{
    BYTE newState[KEY_MAX];
    GetKeyboardState(newState);

    for (int i = 0; i < KEY_MAX; i++)
    {
        // トリガー、リリース
        trigger[i] = (~press[i]) & (newState[i]);
        release[i] = (press[i])  & (~newState[i]);

        // リピート
        if (newState[i] & 0x80)
        {
            repeatCnt[i]--;
            if (repeatCnt[i] <= 0)
            {
                repeat[i] = newState[i];
                repeatCnt[i] = repeatTerm;
            }
            else
            {
                repeat[i] = ~newState[i];
            }
        }
        else
        {
            repeat[i] = newState[i];
            repeatCnt[i] = 0;
        }
    }

    // プレス
    memcpy(press, newState, KEY_MAX);
}

/******************************* 実装ここまで ********************************/
