/*****************************************************************************/
/*!
@file   GameWindow.cpp
@author Yuki Kogawara
@copy   Copyright(C) 2016 Yuki Kogawara

******************************************************************************/

/*  インクルード
******************************************************************************/


#include "GameWindow.h"

using namespace Windows;


/*  実装
******************************************************************************/

/******************************************************************************
@brief  ウインドウが存在するか
@retval true        存在する
@retval false       存在しない
******************************************************************************/

bool GameWindow::Exists()
{
    MSG msg;
    PeekMessage(&msg, NULL, 0, 0, PM_NOREMOVE);
    return (msg.message != WM_QUIT) ? (true) : (false);
}

/******************************************************************************
@brief  処理可能か
@retval true        可能
@retval false       不可能
******************************************************************************/

bool GameWindow::CanProcess()
{
    MSG msg;
    if (PeekMessage(&msg, NULL, 0, 0, PM_REMOVE) != 0)
    {
        TranslateMessage(&msg);
        DispatchMessage(&msg);
        return false;
    }
    return true;
}

/******************************** 実装ここまで *******************************/
