#pragma once
/******************************************************************************
/*!
@file   Bone.h
@author Yuki Kogawara
@copy   Copyright(C) 2016 Yuki Kogawara

******************************************************************************/

/*  インクルード
******************************************************************************/


#include "..\Math\Matrix.h"


/*  クラス定義
******************************************************************************/


namespace Framework
{
    class Bone
    {
    public:
        int    sibling;         // 兄弟
        int    child;           // 子供
        int    parent;          // 親

        Matrix offset;          // オフセット行列
        Matrix advOffset;       // ボーンオフセット行列
        char   name[256];
    };
}


/****************************** ヘッダここまで *******************************/
