#pragma once
/******************************************************************************
/*!
@file   Writer.h
@author Yuki Kogawara
@copy   Copyright(C) 2016 Yuki Kogawara

******************************************************************************/

/*  インクルード
******************************************************************************/


#include <windows.h>


/*  クラス定義
******************************************************************************/


namespace Framework
{
    namespace File
    {
        class Writer
        {
        public:
            virtual void Write(const char *FileName, void *pData, int size){}
        };
    }
}


/****************************** ヘッダここまで *******************************/