#pragma once
/******************************************************************************
/*!
@file   OpenGL.h
@author Yuki Kogawara
@copy   Copyright(C) 2016 Yuki Kogawara

******************************************************************************/

/*  インクルード
******************************************************************************/


#include "../../lib/glew/glew.h"
#include "../../lib/glew/wglew.h"
#include <gl\GL.h>
#include <gl\GLU.h>


/*  ライブラリリンク
******************************************************************************/


#pragma comment( lib, "OpenGL32.lib" )
#pragma comment( lib, "glu32.lib" )
#pragma comment( lib, "lib/glew/glew32.lib" )


/****************************** ヘッダここまで *******************************/
