#pragma once
/*****************************************************************************/
/*!
@file   DirectX.h
@author Yuki Kogawara
@copy   Copyright(C) 2016 Yuki Kogawara

******************************************************************************/

/*  インクルード
******************************************************************************/


#include "d3dx9.h"


/*  ライブラリリンク
******************************************************************************/


#pragma comment( lib, "dxguid.lib" )
#pragma comment( lib, "d3d9.lib" )
#pragma comment( lib, "d3dx9.lib" )


/*  マクロ定義
******************************************************************************/


#define FVF_VERTEX_3D   (D3DFVF_XYZ | D3DFVF_NORMAL | D3DFVF_DIFFUSE | D3DFVF_TEX1)


/*  構造体定義
******************************************************************************/


namespace DirectX
{
    typedef struct
    {
        D3DXVECTOR3 vtx;        // 頂点座標
        D3DXVECTOR3 nor;        // 法線ベクトル
        D3DCOLOR    col;        // 頂点カラー
        D3DXVECTOR2 tex;        // テクスチャ座標
    }VERTEX_3D;
}


/****************************** ヘッダここまで *******************************/